# !/usr/bin/env python
# -*- coding: utf-8 -*-
import os

"""
会从第一个以”/”开头的参数开始拼接，之前的参数全部丢弃。
以上一种情况为先。在上一种情况确保情况下，若出现”./”开头的参数，会从”./”开头的参数的上一个参数开始拼接。
"""

"""
从倒数第一个，以‘/’开头的参数开始拼接，之前的参数全部丢弃。
以‘/’结尾的，以及参数中间有‘/’的，斜杠仅作为参数的一部分。

记不住？？
参数之间，一个‘/’都不要。参数中间是可以有的
"""
import os

print(os.path.join('111', '222', '333'))  # 111/222/333
print(os.path.join('/111', '222', '333'))  # /111/222/333
print(os.path.join('/111', '/222', '333'))  # /222/333

print(os.path.join('/111', '/222', '/333'))  # /333

print(os.path.join('111', '222', '/333'))  # /333
print(os.path.join('111', '/222', '/333'))  # /333
print(os.path.join('/111', '/222', '/333'))  # /333

print(os.path.join('111/', '222', '333'))  # 111/222/333
print(os.path.join('111/', '222/', '333'))  # 111/222/333
print(os.path.join('111/', '222/', '333/'))  # 111/222/333/

print(os.path.join('111', '222', '333/'))  # 111/222/333/
print(os.path.join('111', '222/', '333/'))  # 111/222/333/
print(os.path.join('111/', '222/', '333/'))  # 111/222/333/

print(os.path.join('111', '222', './333'))  # 111/222/./333
